// 응용 포인터_2중 포인터 개념

#include <stdio.h>

int main(void)
{
	int a = 10;
	int* pi;
	int** ppi;

	pi = &a;
	ppi = &pi;

	printf("---------------------------------------------------------------\n");
	printf("변수        변수값        &연산         *연산         **연산\n");
	printf("---------------------------------------------------------------\n");
	printf("  a%14d%14u\n", a, &a);
	printf(" pi%14u%14u%14d\n", pi, &pi, *pi);
	printf("ppi%14u%14u%14u%14u\n", ppi, &ppi, *ppi, **ppi);
	printf("---------------------------------------------------------------\n");

	return 0;
}